In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

dattri_data1 = {'ID': [str(i) for i in range(5)],
                          'Sex': ['M', 'M','F','F','F'],
                          'Money':[1000, 2000,500, 300, 700],
                          'Name':  ['Suzu', 'Haruka', 'Tao', 'Aya', 'Yuko']}
attri_data_frame1 = DataFrame(attri_data1)

  ID Sex  Money    Name
0  0   M   1000    Suzu
1  1   M   2000  Haruka
2  2   F    500     Tao
3  3   F    300     Aya
4  4   F    700    Yuko

In [2]:
# Practice 2-7
attri_data_frame1[attri_data_frame1['Money'] >= 500]

  ID Sex  Money    Name
0  0   M   1000    Suzu
1  1   M   2000  Haruka
2  2   F    500     Tao
4  4   F    700    Yuko

In [6]:
# Practice 2-8
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F     500
M    1500
Name: Money, dtype: int64

In [7]:
# Practice 2-9
attri_data2 = {'ID':['3', '4', '7'],
                          'Math': [60, 30, 40],
                          'English': [80, 20, 30]}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

  ID  Math  English
0  3    60       80
1  4    30       20
2  7    40       30

In [8]:
attri_data_frame_merged = pd.merge(attri_data_frame1, attri_data_frame2)
attri_data_frame_merged

  ID Sex  Money  Name  Math  English
0  3   F    300   Aya    60       80
1  4   F    700  Yuko    30       20

In [16]:
attri_data_frame_merged.drop(['ID'], axis=1).mean()

Money      500.0
Math        45.0
English     50.0
dtype: float64